
// ƒанный класс отвечает за визуальное взаимодействие с пользователем
public class ConsoleView {
	
	// Ётот метод должен будет обрисовывать на экране поле игры. 
	// Ќикакой дополнительной логики, кроме отображени€ на экран
	public void show(Game game) {
		
	}
	
	/* Ётот метод отвечает за один ход. 
	 * ѕри его вызове мы говорим: "UI, запусти все процессы, необходимые дл€ совершени€ хода"

*спроси у того, чей сейчас ход, куда он хочет походить
*попробуй выполнить ход туда, куда хочет пользователь
*верни результат попытки*/
	public boolean move(Game game) {
		return false;
	}

}
